{"modelTopology":{"class_name":"Sequential","config":[{"class_name":"InputLayer","config":{"batch_input_shape":[null,768,1024,3],"dtype":"float32","sparse":false,"name":"input1"}},{"class_name":"Conv2D","config":{"filters":3,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[12,12],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"tanh","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D1","trainable":true}},{"class_name":"Conv2D","config":{"filters":3,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[6,6],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D2","trainable":true}},{"class_name":"Dense","config":{"units":3,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"RandomUniform","config":{"minval":-0.05,"maxval":0.05,"seed":null}},"bias_initializer":{"class_name":"RandomUniform","config":{"minval":-0.05,"maxval":0.05,"seed":null}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1","trainable":true}},{"class_name":"Dense","config":{"units":3,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"RandomUniform","config":{"minval":-0.05,"maxval":0.05,"seed":null}},"bias_initializer":{"class_name":"RandomUniform","config":{"minval":-0.05,"maxval":0.05,"seed":null}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2","trainable":true}},{"class_name":"Dense","config":{"units":3,"activation":"tanh","use_bias":true,"kernel_initializer":{"class_name":"RandomUniform","config":{"minval":-0.05,"maxval":0.05,"seed":null}},"bias_initializer":{"class_name":"RandomUniform","config":{"minval":-0.05,"maxval":0.05,"seed":null}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3","trainable":true}}],"keras_version":"tfjs-layers 0.9.1","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"conv2d_Conv2D1/kernel","shape":[12,12,3,3],"dtype":"float32"},{"name":"conv2d_Conv2D1/bias","shape":[3],"dtype":"float32"},{"name":"conv2d_Conv2D2/kernel","shape":[6,6,3,3],"dtype":"float32"},{"name":"conv2d_Conv2D2/bias","shape":[3],"dtype":"float32"},{"name":"dense_Dense1/kernel","shape":[3,3],"dtype":"float32"},{"name":"dense_Dense1/bias","shape":[3],"dtype":"float32"},{"name":"dense_Dense2/kernel","shape":[3,3],"dtype":"float32"},{"name":"dense_Dense2/bias","shape":[3],"dtype":"float32"},{"name":"dense_Dense3/kernel","shape":[3,3],"dtype":"float32"},{"name":"dense_Dense3/bias","shape":[3],"dtype":"float32"}]}]}